{
  "HOME_SEO_TITLE": "Juan Galue portfolio",
  "HOME_SEO_DESCRIPTION": "My web portfolio designed with NextJS and Typescript",
  "TECH_SEO_TITLE": "Technologies I use",
  "TECH_SEO_DESCRIPTION": "Detail of the technologies I use as a full stack developer with MERN",
  "HERO_TITLE": "MERN Full Stack Developer",
  "HERO_P_1": "At the beginning of the pandemic, I made the decision to turn my working life around. My 14 years of experience in the profession I studied, electrical engineering, no longer met my career expectations.",
  "HERO_P_2": "I love computers and technology since I was a kid, so I decided to study web programming and since then I have focused on learning the MERN stack.",
  "HERO_P_3": "I like to learn new technologies and tools that make the end products more user-friendly.",
  "HERO_P_4": "I will continue studying and doing practical projects to improve my skills and",
  "HERO_P_4_SPAN": "achieve the job reconversion to the IT world.",
  "HERO_BUTTON": "My projects",
  "NAVBAR_LINK_1": "Technologies",
  "NAVBAR_LINK_2": "Projects",
  "NAVBAR_LINK_3": "Diplomas",
  "NAVBAR_LINK_4": "Source",
  "NAVBAR_RESUME_BUTTON": "Resume",
  "TECHNOLOGIES_H3": "Technologies that I use",
  "FRONT_END_H3": "Front-end development",
  "FRONT_END_P_1": "When I started to study by my own, the first thing I learned was HTML, CSS and JavaScript, then I discovered jQuery but it didn't take me long to learn how to use React.js, and since then I have never done projects without this powerful JavaScript library, which helps a lot in the design of user interfaces, writing code in JSX is friendly, and together with the management of the virtual DOM and hooks, this tool is in high demand today. Then I learned Next.js and its great features to generate static pages, path structure with \"pages\", SSR, among others, and after studying TypeScript, I try to write all my code with that programming language.",
  "FRONT_END_P_2": "The main tools that I use are:",
  "SVG_CREDITS": "Web illustrations by Storyset",
  "BACK_END_H3": "Back-end development",
  "BACK_END_P1": "While front-end development is very important because it is what the end user sees - colors, animations, images - the back-end is especially important. The back-end is where the business logic, secure routes, authentications, error handling, middleware, database management, API creation, in short, the brain of a dynamic website, is located."
}
