{
  "404_BUTTON_1": "Go back",
  "404_BUTTON_2": "Take me ",
  "HOME_SEO_TITLE": "Juan Galue portfolio",
  "HOME_SEO_DESCRIPTION": "My web portfolio designed with NextJS and Typescript",
  "TECH_SEO_TITLE": "Technologies I use",
  "TECH_SEO_DESCRIPTION": "Detail of the technologies I use as a full stack developer with MERN",
  "PORTFOLIO_SEO_TITLE": "My web projects",
  "PORTFOLIO_SEO_DESCRIPTION": "Detail of the projects I have done as a full stack developer with MERN",
  "TIC_TAC_TOE_SEO_TITLE": "Tic-Tac-Toe App",
  "TIC_TAC_TOE_SEO_DESCRIPTION": "Tic-Tac-Toe project details",
  "COCKTAILS_DB_SEO_TITLE": "Cocktails App",
  "COCKTAILS_DB_SEO_DESCRIPTION": "Cocktail database project details",
  "LIBRARY_APP_SEO_TITLE": "Books App",
  "LIBRARY_APP_SEO_DESCRIPTION": "Details of a book library project with admin and user mode",
  "WINE_APP_SEO_TITLE": "My Favorite Wines App",
  "WINE_APP_SEO_DESCRIPTION": "Details of the project of an App to register your favorite wines",
  "DIPLOMAS_SEO_TITLE": "Diplomas and certifications",
  "DIPLOMAS_SEO_DESCRIPTION": "List of diplomas, certifications and course completion certificates I have earned as a MERN full stack developer.",
  "MOVIES_APP_SEO_TITLE": "App to search for movies",
  "MOVIES_APP_SEO_DESCRIPTION": "Details of the project of an App to search movies from the OMDB API",
  "SHOPPING_CART_APP_SEO_TITLE": "Shopping cart App",
  "SHOPPING_CART_APP_SEO_DESCRIPTION": "Details of the project of an App to simulate a shopping cart",
  "TODO_APP_SEO_TITLE": "To-do tasks app",
  "TODO_APP_SEO_DESCRIPTION": "App to create, view, edit and delete your to-do tasks",
  "GOOGLE_TRANSLATE_APP_SEO_TITLE": "Google Translate clone app",
  "GOOGLE_TRANSLATE_APP_SEO_DESCRIPTION": "Details of the Google Translate clone project with Typescript",
  "HPQ_APP_SEO_TITLE": "Harry Potter Quiz App",
  "HPQ_APP_SEO_DESCRIPTION": "Details of the Harry Potter Quiz project",
  "HERO_P_1": "I'm an experienced electrical engineer and during the pandemic I decided to follow my passion for technology to become a MERN full-stack developer. My goal is to get my first job in this field and continue to expand my knowledge and skills in web development. I keep up to date with the latest technologies and tools in the industry to create responsive and high quality websites.",
  "HERO_P_2": "If you are looking for a skilled and passionate junior full-stack developer to join your team, I am ready to contribute to your organization and help drive its growth and success. Let's work together to create innovative and dynamic web solutions that solve community problems.",
  "HERO_BUTTON": "My projects",
  "NAVBAR_LINK_1": "Technologies",
  "NAVBAR_LINK_2": "Projects",
  "NAVBAR_LINK_3": "Diplomas",
  "NAVBAR_LINK_4": "Source",
  "NAVBAR_RESUME_BUTTON": "Resume",
  "TECHNOLOGIES_H3": "Technologies that I use",
  "FRONT_END_H3": "Front-end development",
  "FRONT_END_P_1": "When I started to study by my own, the first thing I learned was HTML, CSS and JavaScript, then I discovered jQuery but it didn't take me long to learn how to use React.js, and since then I have never done projects without this powerful JavaScript library, which helps a lot in the design of user interfaces, writing code in JSX is friendly, and together with the management of the virtual DOM and hooks, this tool is in high demand today. Then I learned Next.js and its great features to generate static pages, path structure with \"pages\", SSR, among others, and after studying TypeScript, I try to write all my code with that programming language.",
  "FRONT_END_P_2": "The main tools that I use are:",
  "SVG_CREDITS": "Web illustrations by Storyset",
  "BACK_END_H3": "Back-end development",
  "BACK_END_P1": "While front-end development is very important because it is what the end user sees - colors, animations, images - the back-end is especially important. The back-end is where the business logic, secure routes, authentications, error handling, middleware, database management, API creation, in short, the brain of a dynamic website, is located.",
  "OTHER_TOOLS_H3": "Other useful tools for web development",
  "OTHER_TOOLS_P1": "It is important to use other tools, technologies, to know how to deploy, to use native text editors in the terminal, to use tools to save objects in the cloud, to create and test the APIs of your web applications, to debug your code, among others. Here are some other tools that I also use:",
  "OTHER_TOOLS_LI_3": "Versions control:",
  "OTHER_TOOLS_LI_4": "Deployment:",
  "OTHER_TOOLS_LI_4_U_L1": "Docker & docker-compose",
  "OTHER_TOOLS_LI_5": "Text editors:",
  "OTHER_TOOLS_LI_6": "Operating system for programming:",
  "OTHER_TOOLS_LI_7": "Other programming language:",
  "OTHER_TOOLS_LI_8": "Other tools:",
  "OTHER_TOOLS_LI_8_U_L1": "Terminal management on Mac OS and servers like Ubuntu",
  "PORTFOLIO_H3": "Projects",
  "PORTFOLIO_P1_TITLE": "Tic-tac-toe game",
  "PORTFOLIO_P1_CONTENT": "App for practicing basic React concepts, such as useState.",
  "PORTFOLIO_P2_TITLE": "Cocktails BD",
  "PORTFOLIO_P2_CONTENT": "App that consumes an API with an extensive cocktail database.",
  "PORTFOLIO_P3_TITLE": "CRUD of books",
  "PORTFOLIO_P3_CONTENT": "This app has login and registration with e-mail authentication, protected routes, roles, ratings/comments.",
  "PORTFOLIO_P4_TITLE": "Register your favorite wines",
  "PORTFOLIO_P4_CONTENT": "This app has a simple login and registration, you can use real photos for your wines, give them a score, and so on.",
  "TIC_TAC_TOE_H3": "Projects",
  "TIC_TAC_TOE_H3_SPAN_1": "Tic-Tac-Toe",
  "TIC_TAC_TOE_H3_SPAN_2": "Jan/2023",
  "TIC_TAC_TOE_P1": "This project where the popular game known as tic-tac-toe (also called Noughts and Crosses) was created, tests programming logic and allows to review the fundamental concept of React states, with the hook useState. Use localStorage to save the game.",
  "TIC_TAC_TOE_P2_SPAN": "Website",
  "TIC_TAC_TOE_P3_SPAN": "Deployment",
  "TIC_TAC_TOE_P4_SPAN": "Source code",
  "TIC_TAC_TOE_FIGCAPTION_1": "Screenshot when a game is won",
  "COCKTAILS_DB_H3": "Projects",
  "COCKTAILS_DB_H3_SPAN_1": "Cocktails database",
  "COCKTAILS_DB_H3_SPAN_2": "Oct/2022",
  "COCKTAILS_DB_P1_1": "With this project I learned to use Next.js and I was hooked with its benefits. In this app, I use an API from the folks at ",
  "COCKTAILS_DB_P1_2": ". I make use of Next.js own data fetching tools like getServerSideProps, getStaticProps and getStaticPaths. I wrote an article on how to use them and I'll leave the link below in case you're curious.",
  "COCKTAILS_DB_P2_1": "To increase the efficiency of web page loading time, I used ",
  "COCKTAILS_DB_P2_2": " to dynamically convert the images received from the APIs into a low-resolution version, encoded as a Base64 string. This creates a blur effect while downloading the images.",
  "COCKTAILS_DB_P3": "This project has:",
  "COCKTAILS_DB_UL_L1": "Dynamic pagination when searching for cocktails by name or ingredient",
  "COCKTAILS_DB_UL_L2": "Autocomplete in both search bars",
  "COCKTAILS_DB_UL_L3": "Error handling when trying to search for a cocktail whose name does not exist in the database",
  "COCKTAILS_DB_P4_SPAN": "Website",
  "COCKTAILS_DB_P5_SPAN": "Deployment",
  "COCKTAILS_DB_P5": "Linode with Nginx",
  "COCKTAILS_DB_P6_SPAN": "Article",
  "COCKTAILS_DB_P6": "Using getServerSideProps, getStaticProps and getStaticPaths in Next.js with TypeScript ",
  "COCKTAILS_DB_P7_SPAN": "Source code",
  "COCKTAILS_DB_P8_SPAN": "Next.js, TypeScript, plaiceholder, NProgress, AntDesign, TailwindCSS, FontAwesome, getStaticProps and getStaticPaths for the SSG (static-site generation)",
  "COCKTAILS_DB_P9_SPAN": "getServerSideProps and TheCocktailDB API",
  "COCKTAILS_DB_FIGCAPTION_1": "Detail of a cocktail searched by the ingredient shown with a drawer.",
  "COCKTAILS_DB_FIGCAPTION_2": "Results of the search for cocktails by ingredient",
  "COCKTAILS_DB_FIGCAPTION_3": "Detail of a cocktail of a statically generated page in the build",
  "COCKTAILS_DB_FIGCAPTION_4": "Most popular cocktails. This page is statically generated in the build",
  "LIBRARY_APP_H3": "Projects",
  "LIBRARY_APP_H3_SPAN_1": "Library with admins / readers",
  "LIBRARY_APP_H3_SPAN_2": "Dec/2021",
  "LIBRARY_APP_P1": "The user's experience with this project will depend on whether he/she is an \"admin\" or a normal \"user\". In the admin path, the admin will be able to do a full CRUD of the books, i.e. create, read, update and delete a book. In the user path, users will be able to view the books and leave a rating and comment, and view the comments of other users.",
  "LIBRARY_APP_P2": "This project has:",
  "LIBRARY_APP_UL_L1": "Protected routes, i.e. a user cannot access the functions of an administrator, and vice versa.",
  "LIBRARY_APP_UL_L2": "When logging in, a token is generated which is used to validate if the user has the necessary permissions, for example, if you want to add a book, it is checked that you are an administrator, that the token is valid and that it has not expired, and if everything is OK, you can access the API endpoint to write to the DB.",
  "LIBRARY_APP_UL_L3": "You must register with a real e-mail address, because the e-mail must be validated by entering an OTP, a one-time password, which is sent to the same e-mail address you registered with.",
  "LIBRARY_APP_UL_L4": "The e-mail can be validated at a later time.",
  "LIBRARY_APP_UL_L5": "Change password in case of forgetting it.",
  "LIBRARY_APP_UL_L6": "Redirects to login when the token has expired.",
  "LIBRARY_APP_P3_SPAN": "Website",
  "LIBRARY_APP_P4_SPAN": "Deployment",
  "LIBRARY_APP_P4": "Linode with Nginx",
  "LIBRARY_APP_P5_SPAN": "Source code",
  "LIBRARY_APP_FIGCAPTION_1": "Home page. Displays the top 10 highest rated books. Comments are displayed randomly",
  "LIBRARY_APP_FIGCAPTION_2": "Registration screen. If you know the password, you can register as Admin",
  "LIBRARY_APP_FIGCAPTION_3": "Login screen. Here you can also change the password and validate the e-mail in case the first OTP has expired",
  "LIBRARY_APP_FIGCAPTION_4": "Admin screen where you can make the complete CRUD of a book",
  "LIBRARY_APP_FIGCAPTION_5": "User screen where you can see all the books, their averaged ratings, as well as use the filters and buttons to sort the information in the table",
  "LIBRARY_APP_FIGCAPTION_6": "Modal displaying comments with their respective ratings",
  "WINE_APP_H3": "Projects",
  "WINE_APP_H3_SPAN_1": "Register of your favorite wines",
  "WINE_APP_H3_SPAN_2": "Nov/2021",
  "WINE_APP_P1": "It is a simple app, but it develops the whole concept of full stack MERN, so you can register your favorite wines.",
  "WINE_APP_P2": "This project has:",
  "WINE_APP_UL_L1": "Simple login and registration. You can use a fictitious e-mail address, as no e-mail verification is required.",
  "WINE_APP_UL_L2": "CRUD is basic, you can create your wines, edit them, delete them and display them in a table.",
  "WINE_APP_UL_L3": "The interesting thing about this App is that it connects to AWS s3 to save the users' images. Don't worry, they are saved under a name that is not the original one, and only the App has the credentials to read the objects through a pre-signed url.",
  "WINE_APP_UL_L4": "You can add only one image to each wine.",
  "WINE_APP_UL_L5": "When querying the API endpoints, it validates if the user has the necessary permission using jsonwebtoken, if correct, he/she can write/update the DB.",
  "WINE_APP_P3": "Currently, this deployment is not available, but we can review the code in a face-to-face or virtual interview, and if you like, I can re-deploy it to test it.",
  "WINE_APP_P4": "The last deployment was on Linode using Docker",
  "WINE_APP_FIGCAPTION_1": "User's screen where you can make the complete CRUD of your wines",
  "WINE_APP_FIGCAPTION_2": "Note that when you edit a wine, you can delete the current photo and upload a new one. It is saved in aws-s3",
  "DIPLOMAS_H3": "Diplomas, certifications and course completion certificates",
  "CodingDojo2021_H3": "Full-Stack MERN Developer",
  "CodingDojo2021_H4_1": "16 weeks",
  "CodingDojo2021_H4_2": "Awarded by: Coding Dojo Latam",
  "CodingDojo2021_TIME": "December 10, 2021",
  "CodingDojo2021_P": "HTML, CSS, Git/Github, jQuery, responsive web design, wireframing, JavaScript, Node, Express, Mongo DB, React and deployment.",
  "DIPLOMAS_BUTTON": "Download",
  "Docker2022_H4_1": "4.5 hours",
  "Docker2022_H4_2": "Awarded by: Udemy",
  "Docker2022_TIME": "July 25, 2022",
  "Docker2022_P": "Introduction to Docker, basic Docker commands, building Docker images using Dockerfiles, understanding what is Docker Compose, building applications using Docker Compose.",
  "NextJS2022_H3": "NextJS course",
  "NextJS2022_H4_1": "13.5 hours",
  "NextJS2022_H4_2": "Awarded by: Rootlab",
  "NextJS2022_TIME": "October 2022",
  "NextJS2022_P": "Fundamental Next.js concepts such as routes with pages, API management, static page generation, getServerSideProps, getStaticProps, getStaticProps, image optimization, use of middleware, among others.",
  "PFE2020_H4_1": "32 weeks",
  "PFE2020_H4_2": "Awarded by: University of Michigan via Coursera",
  "PFE2020_TIME": "July 17, 2020",
  "PFE2020_P": "In total there were 5 courses on Python principles, Python data structures, using Python to access data on the web (web scraping), using databases with Python and the final project.",
  "ScriptingInPython2020_H4_1": "16 weeks",
  "ScriptingInPython2020_H4_2": "Awarded by: University of Rice via Coursera",
  "ScriptingInPython2020_TIME": "November 22, 2020",
  "ScriptingInPython2020_P": "In total there were 4 courses on essential programming with Python, data representations with Python, data analysis with Python and data visualization with Python.",
  "LATEST_COURSE": "Latest",
  "TypeScript2023_H4_1": "6 hours and 16 minutes",
  "TypeScript2023_H4_2": "Awarded by: Microsoft Learn",
  "TypeScript2023_TIME": "January 27, 2023",
  "TypeScript2023_P": "It includes declaration of variable types, implementation of interfaces and types, development of functions with types, definition of generics, among others.",
  "WDFE2021_H4_1": "5 months",
  "WDFE2021_H4_2": "Awarded by: University of Michigan via Coursera",
  "WDFE2021_TIME": "June 1, 2021",
  "WDFE2021_P": "In total there were 5 courses on introduction to HTML5, introduction to CSS3, interactivity with JavaScript, advanced styling with responsive design and the final project.",
  "PORTFOLIO_P5_TITLE": "Movie search engine",
  "PORTFOLIO_P5_CONTENT": "App to practice React.js hooks: useRef, useMemo and useCallback",
  "MOVIES_APP_H3_SPAN_1": "Movie search engine",
  "MOVIES_APP_H3_SPAN_2": "Mar/2023",
  "MOVIES_APP_P1_1": "This app allows you to search for movies by querying the free API from ",
  "MOVIES_APP_P1_2": ". The app allows you to search for movies in 2 ways: typing the movie and using a button to click to query the API or searching for the movie while typing in the form, without having to click any button.",
  "MOVIES_APP_P2": "The React.js hooks I used in this App are:",
  "MOVIES_APP_UL_L1": "is a hook that allows us to create a mutable reference that persists throughout the life cycle of the component. It is very useful to store any value that you can mutate, such as an identifier or a DOM element, and that every time it changes its value, it does not render the component again.",
  "MOVIES_APP_UL_L2": "it is used to \"memoize\" a value, so that it does not have to be recalculated unless its dependencies change.",
  "MOVIES_APP_UL_L3": "this hook uses useMemo in the background, and has the same function as useMemo but is intended to be used with functions only. It helps to make writing code easier by adding some \"syntactic sugar\".",
  "MOVIES_APP_P3_SPAN": "Website",
  "MOVIES_APP_P4_SPAN": "Deployment",
  "MOVIES_APP_P5_SPAN": "Source code",
  "MOVIES_APP_FIGCAPTION_1": "Screen to search for a movie after clicking the Search button. The checkbox was clicked to sort the movies alphabetically",
  "MOVIES_APP_FIGCAPTION_2": "Screen to search for a movie while typing. A debounce is used to avoid making erroneous API queries",
  "PORTFOLIO_P6_TITLE": "Shopping cart",
  "PORTFOLIO_P6_CONTENT": "App to practice React.js hooks: useId, useContext and useReducer",
  "SHOPPING_CART_APP_H3_SPAN_1": "Shopping Cart",
  "SHOPPING_CART_APP_H3_SPAN_2": "Mar/2023",
  "SHOPPING_CART_APP_P1_1": "This app allows you to add, delete, increase or decrease the quantity of a product in the shopping cart and clean the shopping cart. The products are fictitious and come from ",
  "SHOPPING_CART_APP_P1_2": ". It also has 2 filters, one by category and one by price. When selecting a new category, the price filter is reset and adjusts its maximum price to the one that corresponds to the selected category.",
  "SHOPPING_CART_APP_UL_L1": "this hook is used to generate unique IDs that can be passed to accessibility attributes. In the case of this project this hook was used to generate unique IDs for the \"inputs\" with their respective \"labels\" in the Price and Category Filters component. An important fact is that this hook should not be used to generate \"keys\" in lists.",
  "SHOPPING_CART_APP_UL_L2": "with this hook we can read and subscribe to the context from any component. The first thing to do is to create the context, then provide our application with the context and all the child components will be able to consume the provided context. This avoids having to do \"prop drilling\". Let's see the following graphs:",
  "SHOPPING_CART_APP_UL_L2_FIGCAPTION_1": "If we do not use the useContext hook, we have to pass the data or functions from the App component, to the AppWrapper, then to the Header and finally to the Filters to be able to use the data in the last child component. In a much more complex application, doing it this way is difficult to write and maintain",
  "SHOPPING_CART_APP_UL_L2_FIGCAPTION_2": "To use the data in Filters or in any other component of the application, we wrap the App with the FilterProviver and simply consume the context where we need it, in this case, in Filters, without having to do any \"props drilling\"",
  "SHOPPING_CART_APP_UL_L3": "is a hook that allows us to manipulate the state of our components in a scalable way, through a \"reducer\" function and a \"dispatch\" callback function with which we can combine or match the state.",
  "SHOPPING_CART_APP_FIGCAPTION_1": "Main screen of the app where we use the category filter by selecting \"Electronics\" and the price filter. We see that in the price filter we have the full range of prices (from $0 to $999) and visually we see the current value of the input, in this case, $186.",
  "SHOPPING_CART_APP_FIGCAPTION_2": "Main screen of the app where we see the shopping cart, where we can increase and decrease the quantity of a product, and clean the shopping cart. We can also see that the icon of the Products screen changes (red cart)",
  "PROJECTS_INTRO": "In this section, you can see the projects that I have created as a full stack developer in MERN. Although I don't have work experience yet in the technology world, these projects are a showcase of my programming skills and experience. I hope they give you an idea of my programming style and ability to create effective solutions to real-world problems.",
  "SCRUM_FOUNDATION_2023_H4_1": "12 hours",
  "SCRUM_FOUNDATION_2023_H4_2": "Awarded by: CertiProf",
  "SCRUM_FOUNDATION_2023_TIME": "April 25, 2023",
  "SCRUM_FOUNDATION_2023_P": "It assesses the basic knowledge of the agile Scrum methodology, covering fundamental principles, key concepts, and how to implement it in team settings.",
  "PORTFOLIO_P7_TITLE": "Tasks organizer",
  "PORTFOLIO_P7_CONTENT": "App to practice a full-stack project with Typescript",
  "TODOS_APP_H3_SPAN_1": "To-do tasks app",
  "TODOS_APP_H3_SPAN_2": "Apr/2023",
  "TODOS_APP_P1": "This application is a To-dos system consisting of two main parts, user management and task management.",
  "TODOS_APP_P2": "User management:",
  "TODOS_APP_UL1_L1": "Allows you to log-in without having to register, you only have to enter a valid e-mail address.",
  "TODOS_APP_UL1_L2": "You will receive a code that must be entered correctly in order to use the application.",
  "TODOS_APP_UL1_L3": "LocalStorage is used to store the token needed to be able to use the application API.",
  "TODOS_APP_P3": "Task management:",
  "TODOS_APP_UL2_L1": "The application allows users to create new tasks.",
  "TODOS_APP_UL2_L2": "The application allows users to mark tasks as completed or pending.",
  "TODOS_APP_UL2_L3": "It also allows you to edit a task by double clicking on it.",
  "TODOS_APP_UL2_L4": "It has filters to view all tasks or only those that are pending or completed.",
  "TODOS_APP_UL2_L5": "Finally, you can delete tasks individually or delete all completed tasks.",
  "TODOS_APP_FIGCAPTION_1": "Screen to enter your valid e-mail address to receive the verification code",
  "TODOS_APP_FIGCAPTION_2": "You will have 3 attempts to enter the code correctly, otherwise, you will have to request a new one",
  "TODOS_APP_FIGCAPTION_3": "You will be automatically redirected to log-in if all your attempts are unsuccessful",
  "TODOS_APP_FIGCAPTION_4": "At all times the user will have feedback on messages from the backend or frontend, using the react-toastify library",
  "TODOS_APP_FIGCAPTION_5": "Application welcome screen",
  "DEPLOYMENT": "Deployment",
  "PORTFOLIO_P8_TITLE": "Google Translate clone",
  "PORTFOLIO_P8_CONTENT": "Made with Typescript and the Open IA API. Supports 3 languages.",
  "GOOGLE_TRANSLATE_APP_H3_SPAN_1": "Google Translate Clone",
  "GOOGLE_TRANSLATE_APP_H3_SPAN_2": "May/2023",
  "GOOGLE_TRANSLATE_APP_P1": "This project consists of a simple clone of Google Translate, it is designed to translate only 3 languages: Spanish, English and German, although it also has a function to detect the source language automatically.",
  "GOOGLE_TRANSLATE_APP_UL_L1": "All the logic encapsulated in a useReducer.",
  "GOOGLE_TRANSLATE_APP_UL_L2": "Allows you to switch languages by clicking on the arrows.",
  "GOOGLE_TRANSLATE_APP_UL_L3": "If you already have a text written in the source language, and you change the target language, it will automatically be translated into the new selected language.",
  "GOOGLE_TRANSLATE_APP_UL_L4": "Allows you to copy the translated text to the clipboard.",
  "GOOGLE_TRANSLATE_APP_UL_L5": "Allows you to reproduce the translated text.",
  "GOOGLE_TRANSLATE_APP_UL_L6": "It has a debounce that makes the translation request to the API after 500ms after the user stops typing.",
  "GOOGLE_TRANSLATE_APP_P3": "This application hasn't been deployed, but we can review the code in a face-to-face or virtual interview, and if you like I can re-deploy it to test it.",
  "GOOGLE_TRANSLATE_APP_FIGCAPTION_1": "Screen of the app where you can see the drop-down menu of the source and target languages, the arrows to switch languages, the button to copy the translated text to the clipboard and the speaker to reproduce the translated text.",
  "IELTS_2014_H3": "Academic IELTS",
  "IELTS_2014_H4_1": "2 weeks",
  "IELTS_2014_H4_2": "Awarded by: British Council",
  "IELTS_2014_TIME": "August 7, 2014",
  "IELTS_2014_P": "Overall band score of 7.0 out of 9.0",
  "PORTFOLIO_P9_TITLE": "Harry Potter Quiz",
  "PORTFOLIO_P9_CONTENT": "App to practice Typescript, React, Zustand and Material UI",
  "HPQ_APP_H3_SPAN_1": "Harry Potter movies Q&A app",
  "HPQ_APP_H3_SPAN_2": "May/2023",
  "HPQ_APP_P1": "This app allows the user to play games to test their knowledge about the Harry Potter movies. This app does not call any API, since the questions with their answers are in a JSON created by myself.",
  "HPQ_APP_P2": "At the technical level, this app has the following features:",
  "HPQ_APP_UL_L1": "I used this library to manage the global state of the application. It is very easy to use, lightweight, has no provider, no configuration, 0 boilerplate and is not opinionated.",
  "HPQ_APP_UL_L2": "The app has a very interesting component that handles the timer to give the user more excitement while answering the questions. It uses useEffect, useState, useRef and dynamic CSS.",
  "HPQ_APP_UL_L3": "Uses modals to give feedback to the user when he/she responds correctly or incorrectly.",
  "HPQ_APP_P3_SPAN": "Website",
  "HPQ_APP_P4_SPAN": "Deployment",
  "HPQ_APP_P5_SPAN": "Source code",
  "HPQ_APP_FIGCAPTION_1": "Screen where you can see that the user has a limited time to answer the question. The bar is green indicating that there is still enough time left",
  "HPQ_APP_FIGCAPTION_2": "Screen where you can see that the time bar is already red, indicating that you will soon run out of time and will have to hurry to select an answer",
  "HPQ_APP_FIGCAPTION_3": "Modal indicating that the selected answer is correct and in the options the correct answer is marked in green",
  "HPQ_APP_FIGCAPTION_4": "Modal indicating that the selected answer is incorrect and in the options the incorrect answer is marked in red and in green the option that was not marked and was the correct one",
  "HPQ_APP_FIGCAPTION_5": "Modal with game results",
  "DEVSLOPES_2021_H4_1": "30 days",
  "DEVSLOPES_2021_H4_2": "Awarded by: Devslopes Academy",
  "DEVSLOPES_2021_TIME": "August 04, 2021",
  "DEVSLOPES_2021_P": "Intensive Javascript course to take you from beginner to intermediate with more than 50 training modules and daily missions to put into practice what you have learned.",
  "READING_LIST_TITLE": "Reading List",
  "READING_LIST_CONTENT": "App to list books, add them to a reading list, filter them by number of pages, literary genre, search them by title, etc.",
  "READING_LIST_CREATION_DATE": "Jul/2023",
  "READING_LIST_SEO_TITLE": "Reading list app",
  "READING_LIST_DESCRIPTION": "Detail of the reading list app, the technologies used and a video of a demo.",
  "READING_LIST_H3": "Projects",
  "READING_LIST_H3_SPAN_1": "Reading list app",
  "READING_LIST_H3_SPAN_2": "Jul/2023",
  "READING_LIST_P1_1": "This is my resolution to the technical test #1 available in the ",
  "READING_LIST_P1_2": ". The portal explains the context of the test, technical requirements, functionalities to be developed, code tips and additional challenges.",
  "READING_LIST_P3": "The following functionalities were successfully developed:",
  "READING_LIST_UL_L1": "Display of available books from a JSON file. It can be easily adapted to be loaded from an API.",
  "READING_LIST_UL_L2": "Creating a reading list",
  "READING_LIST_UL_L3": "Filtering books by literary genre",
  "READING_LIST_UL_L4": "Synchronization of states",
  "READING_LIST_UL_L5": "Data persistence",
  "READING_LIST_UL_L6": "Synchronization between tabs",
  "READING_LIST_UL_L7": "New filter to filter books by number of pages",
  "READING_LIST_UL_L8": "Implements a search functionality in the list of available books",
  "READING_LIST_UL_L9": "Allow reorganization of the books in the reading list by priority",
  "READING_LIST_UL_L10": "Basic tests",
  "READING_LIST_UL_L11": "Deployment",
  "READING_LIST_P4": "Vercel",
  "READING_LIST_P4_SPAN": "React, Vite, Javascript, Zustand, shared-zustand, Ant Design, Vitest, Happy Dom",
  "READING_LIST_P5": "Below is a short video with a demo of the app:"
}
