{
  "404_BUTTON_1": "Volver",
  "404_BUTTON_2": "Regrésame a ",
  "HOME_SEO_TITLE": "Juan Galué portafolio",
  "HOME_SEO_DESCRIPTION": "Mi portafolio web diseñado con NextJS y Typescript",
  "TECH_SEO_TITLE": "Tecnologías que uso",
  "TECH_SEO_DESCRIPTION": "Detalle de las tecnologías que uso como desarrollador full stack con MERN",
  "PORTFOLIO_SEO_TITLE": "Mis proyectos web",
  "PORTFOLIO_SEO_DESCRIPTION": "Detalle de los proyectos que he realizado como desarrollador full stack con MERN",
  "TIC_TAC_TOE_SEO_TITLE": "App de Tic Tac Toe",
  "TIC_TAC_TOE_SEO_DESCRIPTION": "Detalles del proyecto de Tic Tac Toe",
  "COCKTAILS_DB_SEO_TITLE": "App de Cocteles",
  "COCKTAILS_DB_SEO_DESCRIPTION": "Detalles del proyecto de una base de datos de cocteles",
  "LIBRARY_APP_SEO_TITLE": "App de Libros",
  "LIBRARY_APP_SEO_DESCRIPTION": "Detalles del proyecto de una biblioteca de libros con modo admin y usuario",
  "WINE_APP_SEO_TITLE": "App de Mis Vinos Favoritos",
  "WINE_APP_SEO_DESCRIPTION": "Detalles del proyecto de una App para registrar tus vinos favoritos",
  "DIPLOMAS_SEO_TITLE": "Diplomas y certificaciones",
  "DIPLOMAS_SEO_DESCRIPTION": "Detalle de los diplomas, certificaciones y constancias de culminación de cursos que he adquirido como desarrollador full stack con MERN",
  "MOVIES_APP_SEO_TITLE": "App para buscar pelis",
  "MOVIES_APP_SEO_DESCRIPTION": "Detalles del proyecto de una App para buscar películas de la API de OMDB",
  "SHOPPING_CART_APP_SEO_TITLE": "App de carrito de compras",
  "SHOPPING_CART_APP_SEO_DESCRIPTION": "Detalles del proyecto de una App para simular un carrito de compras",
  "TODO_APP_SEO_TITLE": "App de tareas",
  "TODO_APP_SEO_DESCRIPTION": "App para crear, ver, editar y borrar tus tareas pendientes",
  "GOOGLE_TRANSLATE_APP_SEO_TITLE": "App de clon de Google Translate",
  "GOOGLE_TRANSLATE_APP_SEO_DESCRIPTION": "Detalles del proyecto de un clon de Google Translate con Typescript",
  "HPQ_APP_SEO_TITLE": "App de Quiz de Harry Potter",
  "HPQ_APP_SEO_DESCRIPTION": "Detalles del proyecto de la app de quiz de Harry Potter",
  "HERO_P_LOCATION": "Ubicación: ",
  "HERO_P_1": "Soy un ingeniero eléctrico con experiencia y durante la pandemia decidí seguir mi pasión por la tecnología para convertirme en desarrollador full-stack MERN. Mi objetivo es obtener mi primer trabajo en este campo y continuar expandiendo mis conocimientos y habilidades en el desarrollo web. Me mantengo al día con las últimas tecnologías y herramientas de la industria para crear sitios web responsivos y de alta calidad.",
  "HERO_P_2": "Si estás buscando un desarrollador junior full-stack capacitado y apasionado para unirse a tu equipo, estoy preparado para aportar a tu organización y contribuir al crecimiento y éxito de la misma. Trabajemos juntos para crear soluciones web innovadoras y dinámicas que resuelvan los problemas de la comunidad.",
  "HERO_BUTTON": "Mis proyectos",
  "NAVBAR_LINK_1": "Tecnologías",
  "NAVBAR_LINK_2": "Proyectos",
  "NAVBAR_LINK_3": "Diplomas",
  "NAVBAR_LINK_4": "Código",
  "NAVBAR_RESUME_BUTTON": "CV",
  "TECHNOLOGIES_H3": "Tecnologías que uso",
  "FRONT_END_H3": "Desarrollo front-end",
  "FRONT_END_P_1": "Cuando inicié mis estudios de manera autodidacta, lo primero que aprendí fue HTML, CSS y JavaScript, después descubrí jQuery pero no tardé mucho en aprender a usar React.js, y desde entonces más nunca he realizado proyectos sin esta potente biblioteca de JavaScript, la cual ayuda un montón en el diseño de las interfaces de usuario, escribir el código en JSX es amigable, y junto con el manejo del DOM virtual y los hooks hacen que esta herramienta esté en alta demanda hoy en día. Luego aprendí Next.js y sus maravillosas bondades para generar páginas estáticas, estructura de rutas con \"pages\", SSR, entre otros, y luego de estudiar TypeScript, trato de escribir todo mi código con ese lenguaje de programación.",
  "FRONT_END_P_2": "Las principales herramientas que uso son:",
  "SVG_CREDITS": "Las ilustraciones web son de Storyset",
  "BACK_END_H3": "Desarrollo back-end",
  "BACK_END_P1": "Si bien el desarrollo front-end es muy importante porque es lo que ve el usuario final (colores, animaciones, imágenes) el back-end tiene una especial importancia. Es en el back-end donde va la lógica del negocio, las rutas seguras, autenticaciones, manejo de errores, middlewares, manejo de la base de datos, creación de APIs, en fin, es aquí donde está el cerebro de una página web dinámica.",
  "OTHER_TOOLS_H3": "Otras herramientas útiles para el desarrollo web",
  "OTHER_TOOLS_P1": "Para el desarrollo web es importante usar otras herramientas, tecnologías, saber hacer deployment, manejar editores de texto nativos de la terminal, usar herramientas para guardar objetos en la nube, para crear y probar las APIs de tus aplicaciones web, para hacer debug de tu código, entre otros. A continuación otras herramientas que también manejo:",
  "OTHER_TOOLS_LI_3": "Control de versiones:",
  "OTHER_TOOLS_LI_4": "Despliegue:",
  "OTHER_TOOLS_LI_4_U_L1": "Docker y docker-compose",
  "OTHER_TOOLS_LI_5": "Editores de texto:",
  "OTHER_TOOLS_LI_6": "Sistema operativo para programar:",
  "OTHER_TOOLS_LI_7": "Otro lenguaje de programación:",
  "OTHER_TOOLS_LI_8": "Otras herramientas:",
  "OTHER_TOOLS_LI_8_U_L1": "Manejo de terminal en Mac OS y servidores como Ubuntu",
  "PORTFOLIO_H3": "Proyectos",
  "PORTFOLIO_P1_TITLE": "Juego de tic-tac-toe",
  "PORTFOLIO_P1_CONTENT": "App para practicar conceptos básicos de React.js, como useState.",
  "PORTFOLIO_P2_TITLE": "BD de cocteles",
  "PORTFOLIO_P2_CONTENT": "App que consume una API con una extensa base de datos de cocteles.",
  "PORTFOLIO_P3_TITLE": "CRUD de libros",
  "PORTFOLIO_P3_CONTENT": "Esta app tiene login y registro con autenticación de e-mail, rutas protegidas, roles, puntuaciones/comentarios.",
  "PORTFOLIO_P4_TITLE": "Registra tus vinos favoritos",
  "PORTFOLIO_P4_CONTENT": "Esta app tiene login y registro sencillo, puedes usar fotos reales para tus vinos, darle puntuación, entre otros.",
  "TIC_TAC_TOE_H3": "Proyectos",
  "TIC_TAC_TOE_H3_SPAN_1": "Tic-Tac-Toe",
  "TIC_TAC_TOE_H3_SPAN_2": "ene/2023",
  "TIC_TAC_TOE_P1": "Este proyecto donde se creó el juego popular conocido como tic-tac-toe, tres en raya o Xs y Os, pone a prueba la lógica de programación y permite repasar el concepto fundamental de estados de React, con el hook useState. Usa localStorage para guardar la partida.",
  "TIC_TAC_TOE_P2_SPAN": "Sitio web",
  "TIC_TAC_TOE_P3_SPAN": "Despliegue",
  "TIC_TAC_TOE_P4_SPAN": "Código",
  "TIC_TAC_TOE_FIGCAPTION_1": "Captura de pantalla de cuando una partida se gana",
  "COCKTAILS_DB_H3": "Proyectos",
  "COCKTAILS_DB_H3_SPAN_1": "Base de datos de cocteles",
  "COCKTAILS_DB_H3_SPAN_2": "oct/2022",
  "COCKTAILS_DB_P1_1": "Con este proyecto aprendí a usar Next.js y quedé enganchado con sus bondades. En esta app, uso una API de los amigos de ",
  "COCKTAILS_DB_P1_2": ". Hago uso de herramientas de extracción de datos propias de Next.js como getServerSideProps, getStaticProps y getStaticPaths. Escribí un artículo sobre cómo usarlas y abajo les dejaré el enlace por si tienen curiosidad.",
  "COCKTAILS_DB_P2_1": "Para aumentar la eficiencia de la carga de la página web, usé ",
  "COCKTAILS_DB_P2_2": " para convertir de manera dinámica las imágenes recibidas de las APIs en una versión de baja resolución, codificada como un string del tipo Base64. Esto crea un efecto blur mientras se descargan las imágenes.",
  "COCKTAILS_DB_P3": "Este proyecto tiene:",
  "COCKTAILS_DB_UL_L1": "Paginación dinámica cuando se buscan cocteles por su nombre o ingrediente",
  "COCKTAILS_DB_UL_L2": "Autocompletado en las dos barras de búsqueda",
  "COCKTAILS_DB_UL_L3": "Manejo de errores cuando se intenta buscar un coctel cuyo nombre no existe en la base de datos",
  "COCKTAILS_DB_P4_SPAN": "Sitio web",
  "COCKTAILS_DB_P5_SPAN": "Despliegue",
  "COCKTAILS_DB_P5": "Linode con Nginx",
  "COCKTAILS_DB_P6_SPAN": "Artículo",
  "COCKTAILS_DB_P6": "Usando getServerSideProps, getStaticProps y getStaticPaths en Next.js con TypeScript ",
  "COCKTAILS_DB_P7_SPAN": "Código",
  "COCKTAILS_DB_P8_SPAN": "Next.js, TypeScript, plaiceholder, NProgress, AntDesign, TailwindCSS, FontAwesome, getStaticProps y getStaticPaths para el SSG (static-site generation)",
  "COCKTAILS_DB_P9_SPAN": "getServerSideProps y API de TheCocktailDB",
  "COCKTAILS_DB_FIGCAPTION_1": "Detalle de un coctel buscado por el ingrediente mostrado con un drawer",
  "COCKTAILS_DB_FIGCAPTION_2": "Resultados de la búsqueda de cocteles por su ingrediente",
  "COCKTAILS_DB_FIGCAPTION_3": "Detalle de un coctel de una página generada estáticamente en el build",
  "COCKTAILS_DB_FIGCAPTION_4": "Cocteles más populares. Esta página se genera estáticamente en el build",
  "LIBRARY_APP_H3": "Proyectos",
  "LIBRARY_APP_H3_SPAN_1": "Biblioteca con administradores / lectores",
  "LIBRARY_APP_H3_SPAN_2": "dic/2021",
  "LIBRARY_APP_P1": "La experiencia del usuario con este proyecto dependerá de si es \"administrador\" o un \"usuario\" normal. En la ruta del admin, este podrá hacer un CRUD completo de los libros, es decir, crear, leer, actualizar y borrar un libro. En la ruta de los usuarios, estos podrán ver los libros y dejar una puntuación y un comentario, y ver los comentarios de los demás usuarios.",
  "LIBRARY_APP_P2": "Este proyecto tiene:",
  "LIBRARY_APP_UL_L1": "Rutas protegidas, es decir, un usuario no puede acceder a las funciones de un administrador, y viceversa.",
  "LIBRARY_APP_UL_L2": "Al iniciar sesión se genera un token que se usa para validar si el usuario tiene los permisos necesarios, por ejemplo, si desea agregar un libro se comprueba que sea administrador, que el token sea válido y que no haya expirado, y si todo está bien, puede acceder al endpoint de la API para escribir en la BD.",
  "LIBRARY_APP_UL_L3": "Debes registrarte con un e-mail verdadero, porque se debe validar el e-mail ingresando una OTP, contraseña de un solo uso, que se envía al mismo e-mail con que se registró.",
  "LIBRARY_APP_UL_L4": "Posibilidad de validar el e-mail en otro momento.",
  "LIBRARY_APP_UL_L5": "Cambiar contraseña en caso de olvido.",
  "LIBRARY_APP_UL_L6": "Redirecciona al login cuando el token ha expirado.",
  "LIBRARY_APP_P3_SPAN": "Sitio web",
  "LIBRARY_APP_P4_SPAN": "Despliegue",
  "LIBRARY_APP_P4": "Linode con Nginx",
  "LIBRARY_APP_P5_SPAN": "Código",
  "LIBRARY_APP_FIGCAPTION_1": "Página inicial. Muestra el top 10 de los libros mejor puntuados. Los comentarios los muestra de manera aleatoria",
  "LIBRARY_APP_FIGCAPTION_2": "Pantalla de registro. Si te sabes la clave, te puedes registrar como Admin",
  "LIBRARY_APP_FIGCAPTION_3": "Pantalla del inicio de sesión. Acá se puede también cambiar la contraseña y validar el e-mail en caso de que la primera OTP haya vencido",
  "LIBRARY_APP_FIGCAPTION_4": "Pantalla del admin donde se puede hacer el CRUD completo de un libro",
  "LIBRARY_APP_FIGCAPTION_5": "Pantalla del usuario donde se pueden ver todos los libros, sus puntuaciones promediadas, además de poder usar los filtros y botones para ordenar la información de la tabla",
  "LIBRARY_APP_FIGCAPTION_6": "Modal que muestra los comentarios con sus respectivas puntuaciones",
  "WINE_APP_H3": "Proyectos",
  "WINE_APP_H3_SPAN_1": "Registro de tus vinos favoritos",
  "WINE_APP_H3_SPAN_2": "nov/2021",
  "WINE_APP_P1": "Es una app sencilla, pero desarrolla todo el concepto de full stack MERN, para que puedas registrar tus vinos favoritos.",
  "WINE_APP_P2": "Este proyecto tiene:",
  "WINE_APP_UL_L1": "Login y registro sencillo. Puedes usar un correo ficticio, ya que no se requiere verificar el e-mail.",
  "WINE_APP_UL_L2": "El CRUD es básico, puedes crear tus vinos, editarlos, eliminarlos y visualizarlos en una tabla.",
  "WINE_APP_UL_L3": "Lo interesante de esta App es que se conecta con AWS s3 para guardar las imágenes de los usuarios. No se preocupen, se guardan con un nombre que no es el original, y solo la App tiene las credenciales para leer los objetos a través de una url prefirmada.",
  "WINE_APP_UL_L4": "Pueden agregar una sola imagen a cada vino.",
  "WINE_APP_UL_L5": "Al consultar los endpoints de las API, se valida si el usuario tiene el permiso necesario usando jsonwebtoken, de ser correcto, puede escribir/actualizar la BD.",
  "WINE_APP_P3": "Actualmente este despliegue no se encuentra disponible, pero podemos revisar el código en una entrevista presencial o virtual, y si gustan puedo hacer el despliegue de nuevo a manera de prueba.",
  "WINE_APP_P4": "El último despliegue fue en Linode con Docker",
  "WINE_APP_FIGCAPTION_1": "Pantalla del usuario donde puede hacer el CRUD completo de sus vinos",
  "WINE_APP_FIGCAPTION_2": "Observen que cuando edita un vino, se puede borrar la foto actual y subir una nueva. Queda guardada en aws-s3",
  "DIPLOMAS_H3": "Diplomas, certificaciones y constancias de culminación de cursos",
  "CodingDojo2021_H3": "Desarrollador Full-Stack MERN",
  "CodingDojo2021_H4_1": "16 semanas",
  "CodingDojo2021_H4_2": "Otorgado por: Coding Dojo Latam",
  "CodingDojo2021_TIME": "10 de diciembre de 2021",
  "CodingDojo2021_P": "HTML, CSS, Git/Github, jQuery, diseño web responsivo, wireframing, JavaScript, Node, Express, Mongo DB, React y despliegue.",
  "DIPLOMAS_BUTTON": "Descargar",
  "Docker2022_H4_1": "4,5 horas",
  "Docker2022_H4_2": "Otorgado por: Udemy",
  "Docker2022_TIME": "25 de julio de 2022",
  "Docker2022_P": "Introducción a Docker, comandos básicos de Docker, construir imágenes de Docker usando Dockerfiles, entender qué es Docker Compose, construir aplicaciones usando Docker Compose.",
  "NextJS2022_H3": "Curso de NextJS",
  "NextJS2022_H4_1": "13,5 horas",
  "NextJS2022_H4_2": "Otorgado por: Rootlab",
  "NextJS2022_TIME": "Octubre de 2022",
  "NextJS2022_P": "Conceptos fundamentales de Next.js como rutas con pages, manejo de APIs, generación de páginas estáticas, getServerSideProps, getStaticProps, getStaticProps, optimización de imágenes, uso de middleware, entre otros.",
  "PFE2020_H4_1": "32 semanas",
  "PFE2020_H4_2": "Otorgado por: University of Michigan a través de Coursera",
  "PFE2020_TIME": "17 de julio de 2020",
  "PFE2020_P": "En total fueron 5 cursos sobre los principios de Python, las estructuras de datos en Python, usar Python para acceder a data en la web (web scraping), usar bases de datos con Python y el proyecto final.",
  "ScriptingInPython2020_H4_1": "16 semanas",
  "ScriptingInPython2020_H4_2": "Otorgado por: University of Rice a través de Coursera",
  "ScriptingInPython2020_TIME": "22 de noviembre de 2020",
  "ScriptingInPython2020_P": "En total fueron 4 cursos sobre programación esencial con Python, representaciones de data con Python, análisis de datos con Python y visualización de datos con Python.",
  "LATEST_COURSE": "Más reciente",
  "TypeScript2023_H4_1": "6 horas y 16 minutos",
  "TypeScript2023_H4_2": "Otorgado por: Microsoft Learn",
  "TypeScript2023_TIME": "27 de enero de 2023",
  "TypeScript2023_P": "Incluye declaración de tipos de variables, implementación de interfaces y tipos, desarrollo de funciones con tipos, definición de genéricos, entre otros.",
  "WDFE2021_H4_1": "5 meses",
  "WDFE2021_H4_2": "Otorgado por: University of Michigan a través de Coursera",
  "WDFE2021_TIME": "1 de junio de 2021",
  "WDFE2021_P": "En total fueron 5 cursos sobre introducción a HTML5, introducción a CSS3, interactividad con JavaScript, estilado avanzado con diseño responsivo y el proyecto final.",
  "PORTFOLIO_P5_TITLE": "Buscador de películas",
  "PORTFOLIO_P5_CONTENT": "App para practicar los hooks de React.js: useRef, useMemo y useCallback",
  "MOVIES_APP_H3_SPAN_1": "Buscador de películas",
  "MOVIES_APP_H3_SPAN_2": "mar/2023",
  "MOVIES_APP_P1_1": "Esta app permite buscar películas consultando la API gratis de ",
  "MOVIES_APP_P1_2": ". Permite buscar películas de 2 maneras: escribir la película y usar un botón para que al dar un click se realice la consulta a la API o buscar la película mientras se escribe en el formulario, sin tener que dar click a ningún botón.",
  "MOVIES_APP_P2": "Los hooks de React.js que uso en esta App son:",
  "MOVIES_APP_UL_L1": "es un hook que nos permite crear una referencia mutable que persiste durante todo el ciclo de vida del componente. Es muy útil para guardar cualquier valor que puedas mutar, como un identificador o un elemento del DOM, y que cada vez que cambia su valor, no vuelve a renderizar el componente.",
  "MOVIES_APP_UL_L2": "se utiliza para \"memoizar\" un valor, para no tener que volverlo a calcular, a menos que cambien sus dependencias.",
  "MOVIES_APP_UL_L3": "este hook utiliza por debajo a useMemo, y tiene la misma función que el useMemo pero está pensado para usarlo exclusivamente con funciones. Ayuda a simplificar la escritura del código mediante un \"azúcar sintáctico\".",
  "MOVIES_APP_P3_SPAN": "Sitio web",
  "MOVIES_APP_P4_SPAN": "Despliegue",
  "MOVIES_APP_P5_SPAN": "Código",
  "MOVIES_APP_FIGCAPTION_1": "Pantalla para buscar una película luego de hacer click al botón de Buscar. Se le dio click al checkbox para ordenar las películas alfabéticamente",
  "MOVIES_APP_FIGCAPTION_2": "Pantalla para buscar una película mientras se escribe. Se usa un debounce para evitar hacer consultas erróneas a la API",
  "PORTFOLIO_P6_TITLE": "Carrito de compras",
  "PORTFOLIO_P6_CONTENT": "App para practicar los hooks de React.js: useId, useContext y useReducer",
  "SHOPPING_CART_APP_H3_SPAN_1": "Carrito de compras",
  "SHOPPING_CART_APP_H3_SPAN_2": "mar/2023",
  "SHOPPING_CART_APP_P1_1": "Esta app permite agregar, eliminar, aumentar o disminuir la cantidad de un producto en el carrito de compras y limpiar el carrito de compras. Los productos son ficticios y provienen de la ",
  "SHOPPING_CART_APP_P1_2": ". También cuenta con 2 filtros, uno por categoría y uno por precio. Al seleccionar una categoría, el filtro del precio se resetea y ajusta su precio máximo al que corresponde de acuerdo a la categoría seleccionada.",
  "SHOPPING_CART_APP_UL_L1": "este hook se usa para generar IDs únicos que se pueden pasar a atributos de accesibilidad. En el caso de este proyecto se usó este hook para generar IDs únicos para los \"inputs\" con sus respectivas \"labels\" en el componente de los Filtros de precio y categorías. Un dato importante es que no se debe usar este hook para generar \"keys\" en listas.",
  "SHOPPING_CART_APP_UL_L2": "con este hook podemos leer y suscribirnos al contexto desde cualquier componente. Lo primero que se debe hacer es crear el contexto, luego proveer a nuestra aplicación con el contexto y todos los componentes hijos podrán consumir el contexto provisto. Esto evitar tener que hacer \"prop drilling\". Veamos las siguientes gráficas:",
  "SHOPPING_CART_APP_UL_L2_FIGCAPTION_1": "Si no usamos el useContext, tenemos que pasar los datos o funciones desde el componente App, hacia el AppWrapper, luego al Header y finalmente al Filters para poder usar los datos en el último componente hijo. En una aplicación mucho más compleja, hacerlo de esta forma es difícil de escribir y mantener",
  "SHOPPING_CART_APP_UL_L2_FIGCAPTION_2": "Para usar los datos en Filters o en cualquier otro componente de la aplicación, envolvemos la App con el FilterProviver y simplemente consumimos el contexto donde lo necesitemos, en este caso, en Filters, sin tener que hacer \"props drilling\"",
  "SHOPPING_CART_APP_UL_L3": "es un hook que nos permite manipular el estado de nuestros componentes de una manera escalable, a través de una función \"reducer\" y una función de retorno de llamada \"dispatch\" con la cual podemos combinar o emparejar el estado.",
  "SHOPPING_CART_APP_FIGCAPTION_1": "Pantalla principal de la app donde usamos el filtro de categorías al seleccionar \"Electronics\" y el filtro de precios. Vemos que en el filtro de precios tenemos el rango completo de precios (de $0 a $999) y visualmente vemos el valor actual de la entrada, en este caso, $186",
  "SHOPPING_CART_APP_FIGCAPTION_2": "Pantalla principal de la app donde vemos el carrito de compras, donde podemos aumentar y disminuir la cantidad de un producto, y limpiar el carrito de compras. También se observa que cambia el ícono de la pantalla de los Productos (carrito en rojo)",
  "PROJECTS_INTRO": "En esta sección podrás ver los proyectos que he creado como desarrollador full stack en MERN. Aunque aún no tengo experiencia laboral en el mundo de la tecnología, estos proyectos son una muestra de mis habilidades y experiencia en programación. Espero que te den una idea de mi estilo de programación y capacidad para crear soluciones efectivas para problemas del mundo real.",
  "SCRUM_FOUNDATION_2023_H4_1": "12 horas",
  "SCRUM_FOUNDATION_2023_H4_2": "Otorgado por: CertiProf",
  "SCRUM_FOUNDATION_2023_TIME": "25 de abril de 2023",
  "SCRUM_FOUNDATION_2023_P": "Evalúa el conocimiento básico de la metodología ágil de Scrum, cubriendo los principios fundamentales, conceptos clave y cómo implementarlo en equipos de trabajo.",
  "PORTFOLIO_P7_TITLE": "Organizador de tareas",
  "PORTFOLIO_P7_CONTENT": "App para practicar un proyecto full-stack con Typescript",
  "TODOS_APP_H3_SPAN_1": "App de tareas pendientes",
  "TODOS_APP_H3_SPAN_2": "abr/2023",
  "TODOS_APP_P1": "Esta aplicación es un sistema de To-dos que consta de dos partes principales, la administración de los usuarios y la de las tareas.",
  "TODOS_APP_P2": "Administración de usuarios:",
  "TODOS_APP_UL1_L1": "Permite hacer inicio de sesión sin tener que registrarse, solo tiene que ingresar un e-mail válido.",
  "TODOS_APP_UL1_L2": "Recibirá un código que debe ingresar correctamente para poder usar la aplicación.",
  "TODOS_APP_UL1_L3": "Se usa localStorage para guardar el token que se necesita para poder usar la API de la aplicación.",
  "TODOS_APP_P3": "Administración de las tareas:",
  "TODOS_APP_UL2_L1": "La aplicación permite a los usuarios crear nuevas tareas.",
  "TODOS_APP_UL2_L2": "La aplicación permite a los usuarios marcar las tareas como completadas o pendientes.",
  "TODOS_APP_UL2_L3": "También permite editar una tarea haciendo doble click en ella.",
  "TODOS_APP_UL2_L4": "Cuenta con filtros para ver todas las tareas o solamente las que están pendientes o completadas.",
  "TODOS_APP_UL2_L5": "Por último, permite eliminar tareas de manera individual o eliminar todas las tareas completadas.",
  "TODOS_APP_FIGCAPTION_1": "Pantalla para ingresar su e-mail válido para que reciba el código de verificación",
  "TODOS_APP_FIGCAPTION_2": "Tendrá 3 oportunidades para ingresar el código de manera correcta, de lo contrario, tendrá que pedir otro nuevo",
  "TODOS_APP_FIGCAPTION_3": "De manera automática, será redirigido al login si todos sus intentos son fallidos",
  "TODOS_APP_FIGCAPTION_4": "En todo momento el usuario tendrá feedback de los mensajes del backend o frontend, usando la librería react-toastify",
  "TODOS_APP_FIGCAPTION_5": "Pantalla de bienvenida de la aplicación",
  "PROJECTS_WITH_DEPLOYMENTS": "Proyectos con despliegue",
  "PROJECTS_WITHOUT_DEPLOYMENTS": "Proyectos sin despliegue",
  "PORTFOLIO_P8_TITLE": "Clon de Google Translate",
  "PORTFOLIO_P8_CONTENT": "Realizado con Typescript y la API de Open IA. Soporta 3 idiomas.",
  "GOOGLE_TRANSLATE_APP_H3_SPAN_1": "Clon de Google Translate",
  "GOOGLE_TRANSLATE_APP_H3_SPAN_2": "may/2023",
  "GOOGLE_TRANSLATE_APP_P1": "Este proyecto consiste en un clon sencillo de Google Translate, está diseñado para traducir solo 3 idiomas: español, inglés y alemán, aunque también tiene una función para detectar el idioma de origen de manera automática.",
  "GOOGLE_TRANSLATE_APP_UL_L1": "Toda la lógica encapsulada en un useReducer.",
  "GOOGLE_TRANSLATE_APP_UL_L2": "Permite intercambiar los idiomas haciendo click en las flechas.",
  "GOOGLE_TRANSLATE_APP_UL_L3": "Si ya tienes un texto escrito en el idioma de origen, y cambias el idioma de destino, automáticamente se traducirá al nuevo idioma seleccionado.",
  "GOOGLE_TRANSLATE_APP_UL_L4": "Permite copiar en el portapapeles el texto traducido.",
  "GOOGLE_TRANSLATE_APP_UL_L5": "Permite reproducir el texto traducido.",
  "GOOGLE_TRANSLATE_APP_UL_L6": "Tiene un debounce que hace la petición de traducción a la API luego de que transcurren 500ms desde que el usuario deja de escribir.",
  "GOOGLE_TRANSLATE_APP_P3": "Esta aplicación no tiene despliegue, pero podemos revisar el código en una entrevista presencial o virtual, y si gustan puedo hacer el despliegue en vivo a manera de prueba.",
  "GOOGLE_TRANSLATE_APP_FIGCAPTION_1": "Pantalla de la app donde pueden observar el menú desplegable del idioma de origen y el idioma destino, las flechas para intercambiar los idiomas, el botón para copiar el texto traducido en el portapapeles y el parlante para reproducir dicho texto.",
  "IELTS_2014_H3": "IELTS Académico",
  "IELTS_2014_H4_1": "2 semanas",
  "IELTS_2014_H4_2": "Otorgado por: British Council",
  "IELTS_2014_TIME": "07 de agosto de 2014",
  "IELTS_2014_P": "Promedio global de 7.0 de 9.0",
  "PORTFOLIO_P9_TITLE": "Harry Potter Quiz",
  "PORTFOLIO_P9_CONTENT": "App para practicar Typescript, React, Zustand y Material UI",
  "HPQ_APP_H3_SPAN_1": "App de preguntas y respuestas sobre las películas de Harry Potter",
  "HPQ_APP_H3_SPAN_2": "may/2023",
  "HPQ_APP_P1": "Esta app le permite al usuario jugar para que pruebe sus conocimientos sobre las películas de Harry Potter. Esta app no llama a ninguna API, ya que las preguntas con sus respuestas están en un JSON creado por mi persona.",
  "HPQ_APP_P2": "A nivel técnico esta app tiene las siguientes características:",
  "HPQ_APP_UL_L1": "usamos esta librería para manejar el estado global de la aplicación. Es muy sencilla de usar, ligera, no tiene proveedor, sin configuración, 0 boilerplate y no es opinionada.",
  "HPQ_APP_UL_L2": "La app tiene un componente muy interesante que es el que maneja el temporizador para darle al usuario más emoción mientras responde las preguntas. Utiliza useEffect, useState, useRef y CSS dinámico.",
  "HPQ_APP_UL_L3": "Usa modales para darle información al usuario cuando responde de manera correcta o incorrecta.",
  "HPQ_APP_P3_SPAN": "Sitio web",
  "HPQ_APP_P4_SPAN": "Despliegue",
  "HPQ_APP_P5_SPAN": "Código",
  "HPQ_APP_FIGCAPTION_1": "Pantalla donde se puede observar que el usuario tiene un tiempo limitado para responder la pregunta. La barra está en verde indicando que aún le queda suficiente tiempo",
  "HPQ_APP_FIGCAPTION_2": "Pantalla donde se ve que ya la barra de tiempo está en rojo, indicando que pronto no tendrá tiempo y deberá apurarse para seleccionar una respuesta",
  "HPQ_APP_FIGCAPTION_3": "Modal indicando que la respuesta seleccionada es correcta y en las opciones se marca en verde la respuesta correcta",
  "HPQ_APP_FIGCAPTION_4": "Modal indicando que la respuesta seleccionada es incorrecta y en las opciones se marca en rojo la respuesta incorrecta y en verde la opción que no marcó y que era la correcta",
  "HPQ_APP_FIGCAPTION_5": "Modal con los resultados del juego",
  "DEVSLOPES_2021_H4_1": "30 días",
  "DEVSLOPES_2021_H4_2": "Otorgado por: Devslopes Academy",
  "DEVSLOPES_2021_TIME": "04 de agosto de 2021",
  "DEVSLOPES_2021_P": "Curso intensivo de Javascript para llevarte desde principiante hasta intermedio con más de 50 módulos de entrenamiento y misiones diarias para poner en práctica lo aprendido."
}
