{
  "HOME_SEO_TITLE": "Juan Galué portafolio",
  "HOME_SEO_DESCRIPTION": "Mi portafolio web diseñado con NextJS y Typescript",
  "TECH_SEO_TITLE": "Tecnologías que uso",
  "TECH_SEO_DESCRIPTION": "Detalle de las tecnologías que uso como desarrollador full stack con MERN",
  "HERO_TITLE": "Desarrollador Fullstack MERN",
  "HERO_P_1": "En los inicios de la pandemia tomé la decisión de dar un giro a mi vida laboral. Mis 14 años de experiencia en la profesión que estudié, ingeniería eléctrica, ya no satisfacían mis expectativas laborales.",
  "HERO_P_2": "Como desde niño me gustan las computadoras y la tecnología, decidí estudiar programación web y desde entonces me he enfocado en aprender el stack MERN.",
  "HERO_P_3": "Me gusta aprender nuevas tecnologías y herramientas que hagan que los productos finales sean más amigables con los usuarios finales.",
  "HERO_P_4": "Seguiré estudiando y haciendo proyectos prácticos para mejorar mis habilidades y",
  "HERO_P_4_SPAN": "lograr la reconversión laboral al mundo TI.",
  "HERO_BUTTON": "Mis proyectos",
  "NAVBAR_LINK_1": "Tecnologías",
  "NAVBAR_LINK_2": "Proyectos",
  "NAVBAR_LINK_3": "Diplomas",
  "NAVBAR_LINK_4": "Código",
  "NAVBAR_RESUME_BUTTON": "CV",
  "TECHNOLOGIES_H3": "Tecnologías que uso",
  "FRONT_END_H3": "Desarrollo front-end",
  "FRONT_END_P_1": "Cuando inicié mis estudios de manera autodidacta, lo primero que aprendí fue HTML, CSS y JavaScript, después descubrí jQuery pero no tardé mucho en aprender a usar React.js, y desde entonces más nunca he realizado proyectos sin esta potente biblioteca de JavaScript, la cual ayuda un montón en el diseño de las interfaces de usuario, escribir el código en JSX es amigable, y junto con el manejo del DOM virtual y los hooks hacen que esta herramienta esté en alta demanda hoy en día. Luego aprendí Next.js y sus maravillosas bondades para generar páginas estáticas, estructura de rutas con \"pages\", SSR, entre otros, y luego de estudiar TypeScript, trato de escribir todo mi código con ese lenguaje de programación.",
  "FRONT_END_P_2": "Las principales herramientas que uso son:",
  "SVG_CREDITS": "Las ilustraciones web son de Storyset",
  "BACK_END_H3": "Desarrollo back-end",
  "BACK_END_P1": "Si bien el desarrollo front-end es muy importante porque es lo que ve el usuario final (colores, animaciones, imágenes) el back-end tiene una especial importancia. Es en el back-end donde va la lógica del negocio, las rutas seguras, autenticaciones, manejo de errores, middlewares, manejo de la base de datos, creación de APIs, en fin, es aquí donde está el cerebro de una página web dinámica.",
  "OTHER_TOOLS_H3": "Otras herramientas útiles para el desarrollo web",
  "OTHER_TOOLS_P1": "Para el desarrollo web es importante usar otras herramientas, tecnologías, saber hacer deployment, manejar editores de texto nativos de la terminal, usar herramientas para guardar objetos en la nube, para crear y probar las APIs de tus aplicaciones web, para hacer debug de tu código, entre otros. A continuación otras herramientas que también manejo:",
  "OTHER_TOOLS_LI_3": "Control de versiones:",
  "OTHER_TOOLS_LI_4": "Despliegue:",
  "OTHER_TOOLS_LI_4_U_L1": "Docker y docker-compose",
  "OTHER_TOOLS_LI_5": "Editores de texto:",
  "OTHER_TOOLS_LI_6": "Sistema operativo para programar:",
  "OTHER_TOOLS_LI_7": "Otro lenguaje de programación:",
  "OTHER_TOOLS_LI_8": "Otras herramientas:",
  "OTHER_TOOLS_LI_8_U_L1": "Manejo de terminal en Mac OS y servidores como Ubuntu"
}
