{
  "404_BUTTON_1": "Volver",
  "404_BUTTON_2": "Regrésame a ",
  "HOME_SEO_TITLE": "Juan Galué portafolio",
  "HOME_SEO_DESCRIPTION": "Mi portafolio web diseñado con NextJS y Typescript",
  "TECH_SEO_TITLE": "Tecnologías que uso",
  "TECH_SEO_DESCRIPTION": "Detalle de las tecnologías que uso como desarrollador full stack con MERN",
  "PORTFOLIO_SEO_TITLE": "Mis proyectos web",
  "PORTFOLIO_SEO_DESCRIPTION": "Detalle de los proyectos que he realizado como desarrollador full stack con MERN",
  "TIC_TAC_TOE_SEO_TITLE": "App de Tic Tac Toe",
  "TIC_TAC_TOE_SEO_DESCRIPTION": "Detalles del proyecto de Tic Tac Toe",
  "COCKTAILS_DB_SEO_TITLE": "App de Cocteles",
  "COCKTAILS_DB_SEO_DESCRIPTION": "Detalles del proyecto de una base de datos de cocteles",
  "LIBRARY_APP_SEO_TITLE": "App de Libros",
  "LIBRARY_APP_SEO_DESCRIPTION": "Detalles del proyecto de una biblioteca de libros con modo admin y usuario",
  "DIPLOMAS_SEO_TITLE": "Diplomas y certificaciones",
  "DIPLOMAS_SEO_DESCRIPTION": "Detalle de los diplomas, certificaciones y constancias de culminación de cursos que he adquirido como desarrollador full stack con MERN",
  "WINE_APP_SEO_TITLE": "App de Mis Vinos Favoritos",
  "WINE_APP_SEO_DESCRIPTION": "Detalles del proyecto de una App para registrar tus vinos favoritos",
  "HERO_TITLE": "Desarrollador Fullstack MERN",
  "HERO_P_1": "En los inicios de la pandemia tomé la decisión de dar un giro a mi vida laboral. Mis 14 años de experiencia en la profesión que estudié, ingeniería eléctrica, ya no satisfacían mis expectativas laborales.",
  "HERO_P_2": "Como desde niño me gustan las computadoras y la tecnología, decidí estudiar programación web y desde entonces me he enfocado en aprender el stack MERN.",
  "HERO_P_3": "Me gusta aprender nuevas tecnologías y herramientas que hagan que los productos finales sean más amigables con los usuarios finales.",
  "HERO_P_4": "Seguiré estudiando y haciendo proyectos prácticos para mejorar mis habilidades y",
  "HERO_P_4_SPAN": "lograr la reconversión laboral al mundo TI.",
  "HERO_BUTTON": "Mis proyectos",
  "NAVBAR_LINK_1": "Tecnologías",
  "NAVBAR_LINK_2": "Proyectos",
  "NAVBAR_LINK_3": "Diplomas",
  "NAVBAR_LINK_4": "Código",
  "NAVBAR_RESUME_BUTTON": "CV",
  "TECHNOLOGIES_H3": "Tecnologías que uso",
  "FRONT_END_H3": "Desarrollo front-end",
  "FRONT_END_P_1": "Cuando inicié mis estudios de manera autodidacta, lo primero que aprendí fue HTML, CSS y JavaScript, después descubrí jQuery pero no tardé mucho en aprender a usar React.js, y desde entonces más nunca he realizado proyectos sin esta potente biblioteca de JavaScript, la cual ayuda un montón en el diseño de las interfaces de usuario, escribir el código en JSX es amigable, y junto con el manejo del DOM virtual y los hooks hacen que esta herramienta esté en alta demanda hoy en día. Luego aprendí Next.js y sus maravillosas bondades para generar páginas estáticas, estructura de rutas con \"pages\", SSR, entre otros, y luego de estudiar TypeScript, trato de escribir todo mi código con ese lenguaje de programación.",
  "FRONT_END_P_2": "Las principales herramientas que uso son:",
  "SVG_CREDITS": "Las ilustraciones web son de Storyset",
  "BACK_END_H3": "Desarrollo back-end",
  "BACK_END_P1": "Si bien el desarrollo front-end es muy importante porque es lo que ve el usuario final (colores, animaciones, imágenes) el back-end tiene una especial importancia. Es en el back-end donde va la lógica del negocio, las rutas seguras, autenticaciones, manejo de errores, middlewares, manejo de la base de datos, creación de APIs, en fin, es aquí donde está el cerebro de una página web dinámica.",
  "OTHER_TOOLS_H3": "Otras herramientas útiles para el desarrollo web",
  "OTHER_TOOLS_P1": "Para el desarrollo web es importante usar otras herramientas, tecnologías, saber hacer deployment, manejar editores de texto nativos de la terminal, usar herramientas para guardar objetos en la nube, para crear y probar las APIs de tus aplicaciones web, para hacer debug de tu código, entre otros. A continuación otras herramientas que también manejo:",
  "OTHER_TOOLS_LI_3": "Control de versiones:",
  "OTHER_TOOLS_LI_4": "Despliegue:",
  "OTHER_TOOLS_LI_4_U_L1": "Docker y docker-compose",
  "OTHER_TOOLS_LI_5": "Editores de texto:",
  "OTHER_TOOLS_LI_6": "Sistema operativo para programar:",
  "OTHER_TOOLS_LI_7": "Otro lenguaje de programación:",
  "OTHER_TOOLS_LI_8": "Otras herramientas:",
  "OTHER_TOOLS_LI_8_U_L1": "Manejo de terminal en Mac OS y servidores como Ubuntu",
  "PORTFOLIO_H3": "Proyectos",
  "PORTFOLIO_P1_TITLE": "Juego de tic-tac-toe",
  "PORTFOLIO_P1_CONTENT": "App para practicar conceptos básicos de React, como useState.",
  "PORTFOLIO_P2_TITLE": "BD de cocteles",
  "PORTFOLIO_P2_CONTENT": "App que consume una API con una extensa base de datos de cocteles.",
  "PORTFOLIO_P3_TITLE": "CRUD de libros",
  "PORTFOLIO_P3_CONTENT": "Esta app tiene login y registro con autenticación de e-mail, rutas protegidas, roles, puntuaciones/comentarios.",
  "PORTFOLIO_P4_TITLE": "Registra tus vinos favoritos",
  "PORTFOLIO_P4_CONTENT": "Esta app tiene login y registro sencillo, puedes usar fotos reales para tus vinos, darle puntuación, entre otros.",
  "TIC_TAC_TOE_H3": "Proyecto",
  "TIC_TAC_TOE_H3_SPAN_1": "Tic-Tac-Toe",
  "TIC_TAC_TOE_H3_SPAN_2": "ene/2023",
  "TIC_TAC_TOE_P1": "Este proyecto donde se creó el juego popular conocido como tic-tac-toe, tres en raya o Xs y Os, pone a prueba la lógica de programación y permite repasar el concepto fundamental de estados de React, con el hook useState. Usa localStorage para guardar la partida.",
  "TIC_TAC_TOE_P2_SPAN": "Sitio web",
  "TIC_TAC_TOE_P3_SPAN": "Despliegue",
  "TIC_TAC_TOE_P4_SPAN": "Código",
  "TIC_TAC_TOE_FIGCAPTION_1": "Captura de pantalla de cuando una partida se gana",
  "COCKTAILS_DB_H3": "Proyecto",
  "COCKTAILS_DB_H3_SPAN_1": "Base de datos de cocteles",
  "COCKTAILS_DB_H3_SPAN_2": "oct/2022",
  "COCKTAILS_DB_P1_1": "Con este proyecto aprendí a usar Next.js y quedé enganchado con sus bondades. En esta app, uso una API de los amigos de ",
  "COCKTAILS_DB_P1_2": ". Hago uso de herramientas de extracción de datos propias de Next.js como getServerSideProps, getStaticProps y getStaticPaths. Escribí un artículo sobre cómo usarlas y abajo les dejaré el enlace por si tienen curiosidad.",
  "COCKTAILS_DB_P2_1": "Para aumentar la eficiencia de la carga de la página web, usé ",
  "COCKTAILS_DB_P2_2": " para convertir de manera dinámica las imágenes recibidas de las APIs en una versión de baja resolución, codificada como un string del tipo Base64. Esto crea un efecto blur mientras se descargan las imágenes.",
  "COCKTAILS_DB_P3": "Este proyecto tiene:",
  "COCKTAILS_DB_UL_L1": "Paginación dinámica cuando se buscan cocteles por su nombre o ingrediente",
  "COCKTAILS_DB_UL_L2": "Autocompletado en las dos barras de búsqueda",
  "COCKTAILS_DB_UL_L3": "Manejo de errores cuando se intenta buscar un coctel cuyo nombre no existe en la base de datos",
  "COCKTAILS_DB_P4_SPAN": "Sitio web",
  "COCKTAILS_DB_P5_SPAN": "Despliegue",
  "COCKTAILS_DB_P5": "Linode con Nginx",
  "COCKTAILS_DB_P6_SPAN": "Artículo",
  "COCKTAILS_DB_P6": "Usando getServerSideProps, getStaticProps y getStaticPaths en Next.js con TypeScript ",
  "COCKTAILS_DB_P7_SPAN": "Código",
  "COCKTAILS_DB_P8_SPAN": "Next.js, TypeScript, plaiceholder, NProgress, AntDesign, TailwindCSS, FontAwesome, getStaticProps y getStaticPaths para el SSG (static-site generation)",
  "COCKTAILS_DB_P9_SPAN": "getServerSideProps y API de TheCocktailDB",
  "COCKTAILS_DB_FIGCAPTION_1": "Detalle de un coctel buscado por el ingrediente mostrado con un drawer",
  "COCKTAILS_DB_FIGCAPTION_2": "Resultados de la búsqueda de cocteles por su ingrediente",
  "COCKTAILS_DB_FIGCAPTION_3": "Detalle de un coctel de una página generada estáticamente en el build",
  "COCKTAILS_DB_FIGCAPTION_4": "Cocteles más populares. Esta página se genera estáticamente en el build",
  "LIBRARY_APP_H3": "Proyecto",
  "LIBRARY_APP_H3_SPAN_1": "Biblioteca con administradores / lectores",
  "LIBRARY_APP_H3_SPAN_2": "dic/2021",
  "LIBRARY_APP_P1": "La experiencia del usuario con este proyecto dependerá de si es \"administrador\" o un \"usuario\" normal. En la ruta del admin, este podrá hacer un CRUD completo de los libros, es decir, crear, leer, actualizar y borrar un libro. En la ruta de los usuarios, estos podrán ver los libros y dejar una puntuación y un comentario, y ver los comentarios de los demás usuarios.",
  "LIBRARY_APP_P2": "Este proyecto tiene:",
  "LIBRARY_APP_UL_L1": "Rutas protegidas, es decir, un usuario no puede acceder a las funciones de un administrador, y viceversa.",
  "LIBRARY_APP_UL_L2": "Al iniciar sesión se genera un token que se usa para validar si el usuario tiene los permisos necesarios, por ejemplo, si desea agregar un libro se comprueba que sea administrador, que el token sea válido y que no haya expirado, y si todo está bien, puede acceder al endpoint de la API para escribir en la BD.",
  "LIBRARY_APP_UL_L3": "Debes registrarte con un e-mail verdadero, porque se debe validar el e-mail ingresando una OTP, contraseña de un solo uso, que se envía al mismo e-mail con que se registró.",
  "LIBRARY_APP_UL_L4": "Posibilidad de validar el e-mail en otro momento.",
  "LIBRARY_APP_UL_L5": "Cambiar contraseña en caso de olvido.",
  "LIBRARY_APP_UL_L6": "Redirecciona al login cuando el token ha expirado.",
  "LIBRARY_APP_P3_SPAN": "Sitio web",
  "LIBRARY_APP_P4_SPAN": "Despliegue",
  "LIBRARY_APP_P4": "Linode con Nginx",
  "LIBRARY_APP_P5_SPAN": "Código",
  "LIBRARY_APP_FIGCAPTION_1": "Página inicial. Muestra el top 10 de los libros mejor puntuados. Los comentarios los muestra de manera aleatoria",
  "LIBRARY_APP_FIGCAPTION_2": "Pantalla de registro. Si te sabes la clave, te puedes registrar como Admin",
  "LIBRARY_APP_FIGCAPTION_3": "Pantalla del inicio de sesión. Acá se puede también cambiar la contraseña y validar el e-mail en caso de que la primera OTP haya vencido",
  "LIBRARY_APP_FIGCAPTION_4": "Pantalla del admin donde se puede hacer el CRUD completo de un libro",
  "LIBRARY_APP_FIGCAPTION_5": "Pantalla del usuario donde se pueden ver todos los libros, sus puntuaciones promediadas, además de poder usar los filtros y botones para ordenar la información de la tabla",
  "LIBRARY_APP_FIGCAPTION_6": "Modal que muestra los comentarios con sus respectivas puntuaciones",
  "WINE_APP_H3": "Proyecto",
  "WINE_APP_H3_SPAN_1": "Registro de tus vinos favoritos",
  "WINE_APP_H3_SPAN_2": "nov/2021",
  "WINE_APP_P1": "Es una app sencilla, pero desarrolla todo el concepto de full stack MERN, para que puedas registrar tus vinos favoritos.",
  "WINE_APP_P2": "Este proyecto tiene:",
  "WINE_APP_UL_L1": "Login y registro sencillo. Puedes usar un correo ficticio, ya que no se requiere verificar el e-mail.",
  "WINE_APP_UL_L2": "El CRUD es básico, puedes crear tus vinos, editarlos, eliminarlos y visualizarlos en una tabla.",
  "WINE_APP_UL_L3": "Lo interesante de esta App es que se conecta con AWS s3 para guardar las imágenes de los usuarios. No se preocupen, se guardan con un nombre que no es el original, y solo la App tiene las credenciales para leer los objetos a través de una url prefirmada.",
  "WINE_APP_UL_L4": "Pueden agregar una sola imagen a cada vino.",
  "WINE_APP_UL_L5": "Al consultar los endpoints de las API, se valida si el usuario tiene el permiso necesario usando jsonwebtoken, de ser correcto, puede escribir/actualizar la BD.",
  "WINE_APP_P4": "Linode con Docker",
  "WINE_APP_FIGCAPTION_1": "Pantalla del usuario donde puede hacer el CRUD completo de sus vinos",
  "WINE_APP_FIGCAPTION_2": "Observen que cuando edita un vino, se puede borrar la foto actual y subir una nueva. Queda guardada en aws-s3",
  "DIPLOMAS_H3": "Diplomas, certificaciones y constancias de culminación de cursos",
  "CodingDojo2021_H3": "Desarrollador Full-Stack MERN",
  "CodingDojo2021_H4_1": "16 semanas",
  "CodingDojo2021_H4_2": "Otorgado por: Coding Dojo Latam",
  "CodingDojo2021_TIME": "10 de diciembre de 2021",
  "CodingDojo2021_P": "HTML, CSS, Git/Github, jQuery, diseño web responsivo, wireframing, JavaScript, Node, Express, Mongo DB, React y despliegue.",
  "DIPLOMAS_BUTTON": "Descargar",
  "Docker2022_H3": "Docker for the Absolute Beginner - Hands On - DevOps",
  "Docker2022_H4_1": "4,5 horas",
  "Docker2022_H4_2": "Otorgado por: Udemy",
  "Docker2022_TIME": "25 de julio de 2022",
  "Docker2022_P": "Introducción a Docker, comandos básicos de Docker, construir imágenes de Docker usando Dockerfiles, entender qué es Docker Compose, construir aplicaciones usando Docker Compose.",
  "NextJS2022_H3": "Curso de NextJS",
  "NextJS2022_H4_1": "13,5 horas",
  "NextJS2022_H4_2": "Otorgado por: Rootlab",
  "NextJS2022_TIME": "Octubre de 2022",
  "NextJS2022_P": "Conceptos fundamentales de Next.js como rutas con pages, manejo de APIs, generación de páginas estáticas, getServerSideProps, getStaticProps, getStaticProps, optimización de imágenes, uso de middleware, entre otros.",
  "PFE2020_H3": "Python for Everybody",
  "PFE2020_H4_1": "32 semanas",
  "PFE2020_H4_2": "Otorgado por: University of Michigan a través de Coursera",
  "PFE2020_TIME": "17 de julio de 2020",
  "PFE2020_P": "En total fueron 5 cursos sobre los principios de Python, las estructuras de datos en Python, usar Python para acceder a data en la web (web scraping), usar bases de datos con Python y el proyecto final.",
  "ScriptingInPython2020_H3": "Introduction to Scripting in Python",
  "ScriptingInPython2020_H4_1": "16 semanas",
  "ScriptingInPython2020_H4_2": "Otorgado por: University of Rice a través de Coursera",
  "ScriptingInPython2020_TIME": "22 de noviembre de 2020",
  "ScriptingInPython2020_P": "En total fueron 4 cursos sobre programación esencial con Python, representaciones de data con Python, análisis de datos con Python y visualización de datos con Python.",
  "LATEST_COURSE": "Más reciente",
  "TypeScript2023_H4_1": "6 horas y 16 minutos",
  "TypeScript2023_H4_2": "Otorgado por: Microsoft Learn",
  "TypeScript2023_TIME": "27 de enero de 2023",
  "TypeScript2023_P": "Incluye declaración de tipos de variables, implementación de interfaces y tipos, desarrollo de funciones con tipos, definición de genéricos, entre otros.",
  "WDFE2021_H4_1": "5 meses",
  "WDFE2021_H4_2": "Otorgado por: University of Michigan a través de Coursera",
  "WDFE2021_TIME": "1 de junio de 2021",
  "WDFE2021_P": "En total fueron 5 cursos sobre introducción a HTML5, introducción a CSS3, interactividad con JavaScript, estilado avanzado con diseño responsivo y el proyecto final."
}
